[{"data":1,"prerenderedAt":76},["Reactive",2],{"content-query-nbmTghujge":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"tags":11,"image":14,"readingTime":15,"layout":16,"body":17,"_type":71,"_id":72,"_source":73,"_file":74,"_extension":75},"/articles/not-an-impostor","articles",false,"en","You are not an impostor","In the theater of content creation, many backstage whisper a phrase tinged with doubt: 'I m not legitimate, others are so much better.' This melody of insecurity, often played over and over in the minds of emerging creators, is the first act of a much larger work: the conquest of one's own legitimacy.","11/01/2024",[12,13],"Creation","Productivity","https://canvas.hrcd.fr/articles/trap-of-perfection.jpg","3","article",{"type":18,"children":19,"toc":67},"root",[20,31,37,42,47,52,57,62],{"type":21,"tag":22,"props":23,"children":24},"element","p",{},[25],{"type":21,"tag":26,"props":27,"children":30},"img",{"alt":28,"src":29},"preview","/articles/trap-of-perfection.jpg",[],{"type":21,"tag":22,"props":32,"children":33},{},[34],{"type":35,"value":36},"text","In the theater of content creation, there are many who, backstage, whisper a phrase tinged with doubt: \"I'm not legitimate, others are so much better\". This melody of insecurity, often played over and over in the minds of emerging creators, is the first act of a much larger work: the conquest of one's own legitimacy.",{"type":21,"tag":22,"props":38,"children":39},{},[40],{"type":35,"value":41},"Imagine yourself standing at the edge of the stage, dazzled by the spotlight of self-judgment. Every creator goes through this. But instead of sinking into the shadows of self-deprecation, take a moment to listen to the whispers of the audience: the other creators. What you hear is not a cacophony of criticism, but a chorus of experiences and lessons.",{"type":21,"tag":22,"props":43,"children":44},{},[45],{"type":35,"value":46},"This is where the magic happens. Instead of seeing the stage as a place for competition, turn it into a space for learning. Let other people's successes inspire you, their mistakes teach you. This is not imitation, but a creative harmony where you can find your own rhythm, your own melody.",{"type":21,"tag":22,"props":48,"children":49},{},[50],{"type":35,"value":51},"Your authenticity is your most precious instrument. Play it with confidence. Every note of your experience, your perspective, resonates in a unique way with your audience. Authenticity is a creator's true opus, far more captivating than the exhausting quest for perfection.",{"type":21,"tag":22,"props":53,"children":54},{},[55],{"type":35,"value":56},"Remember, every creation is a rehearsal for the next. There's no grand finale where everything has to be perfect. It's a continuous concert, where each performance is better than the last.",{"type":21,"tag":22,"props":58,"children":59},{},[60],{"type":35,"value":61},"And in this showroom, you're not alone. Backstage, you'll find plenty of mentors, peers and admirers. They're there to encourage you, to guide you, to applaud your successes and support you in your doubts. This community is your chorus of support, turning fearful solos into courageous duets.",{"type":21,"tag":22,"props":63,"children":64},{},[65],{"type":35,"value":66},"In the end, every curtain raised, every light turned on, is a step closer to accepting your own talent. The feeling of imposture dissipates not when you compare yourself to others, but when you recognize the unique beauty of your own performance. In this room, success is measured not just by the applause at the end, but by the courage to get up on stage and say: \"Here's my story, listen to it\".",{"title":68,"searchDepth":69,"depth":69,"links":70},"",2,[],"markdown","content:en:articles:not-an-impostor.md","content","en/articles/not-an-impostor.md","md",1716357232699]