[{"data":1,"prerenderedAt":143},["Reactive",2],{"content-query-55NjCJbMZm":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"tags":11,"image":16,"readingTime":17,"layout":18,"body":19,"_type":138,"_id":139,"_source":140,"_file":141,"_extension":142},"/articles/launch-your-portfolio","articles",false,"en","Finally launch your portfolio","Aiming for perfectionism is a very good state of mind. On the other hand, working until perfectionism is 100% can also be bad. Here are some tips to help you get your portfolio off the ground.","20/10/2023",[12,13,14,15],"Portfolio","Development","Design","Productivity","https://canvas.hrcd.fr/articles/launch-your-porfolio.jpg","5","article",{"type":20,"children":21,"toc":124},"root",[22,31,37,46,53,58,64,69,75,80,86,91,97,102,108,113,119],{"type":23,"tag":24,"props":25,"children":27},"element","h2",{"id":26},"introduction",[28],{"type":29,"value":30},"text","Introduction",{"type":23,"tag":32,"props":33,"children":34},"p",{},[35],{"type":29,"value":36},"Creating a portfolio as a development, design or tech professional is a journey punctuated by complex choices. One of the most prevalent of these dilemmas lies in the delicate balance between striving for perfection and the need to launch quickly. Explore with me the nuances of these contradictory perspectives.",{"type":23,"tag":32,"props":38,"children":39},{},[40],{"type":23,"tag":41,"props":42,"children":45},"img",{"alt":43,"src":44},"preview","/articles/launch-your-porfolio.jpg",[],{"type":23,"tag":47,"props":48,"children":50},"h3",{"id":49},"the-aspiration-to-perfection-an-unattainable-ideal",[51],{"type":29,"value":52},"The aspiration to perfection: an unattainable ideal?",{"type":23,"tag":32,"props":54,"children":55},{},[56],{"type":29,"value":57},"The traditional vision of artistic creation encourages us to pursue perfection from the outset. Every line of code, every element of design should converge towards absolute excellence. However, this dream of perfection can sometimes become a burden, a brake on progress. The relentless quest for perfection can paralyze the creative process, turning creation into an endless pursuit.",{"type":23,"tag":47,"props":59,"children":61},{"id":60},"the-perfectionism-trap-when-the-best-becomes-the-enemy-of-the-good",[62],{"type":29,"value":63},"The Perfectionism Trap: when the best becomes the enemy of the good",{"type":23,"tag":32,"props":65,"children":66},{},[67],{"type":29,"value":68},"Perfectionism can turn into a subtle trap. Waiting for every detail to be impeccable can delay your portfolio indefinitely. This prolonged stalling can have implications for professional credibility, as the market often demands a fast, dynamic online presence.",{"type":23,"tag":47,"props":70,"children":72},{"id":71},"the-bold-proposal-to-launch-quickly-iterate-rather-than-perfect",[73],{"type":29,"value":74},"The bold proposal to launch quickly: iterate rather than perfect",{"type":23,"tag":32,"props":76,"children":77},{},[78],{"type":29,"value":79},"The idea of launching quickly, even if the portfolio doesn't reach an immediate level of perfection, offers an alternative perspective. It's about recognizing that each iteration can be an improvement on the previous one. This approach encourages a constant iteration mentality, where each version becomes a learning opportunity.",{"type":23,"tag":47,"props":81,"children":83},{"id":82},"speed-as-a-means-of-learning-create-by-doing",[84],{"type":29,"value":85},"Speed as a means of learning: create by doing",{"type":23,"tag":32,"props":87,"children":88},{},[89],{"type":29,"value":90},"Launching quickly thus becomes a means of learning. Speed doesn't mean compromising on quality, but rather accepting that perfection may initially be unattainable. It's an invitation to learn by doing, to use each version of the portfolio as a testing ground.",{"type":23,"tag":47,"props":92,"children":94},{"id":93},"the-crucial-importance-of-time-time-efficiency-and-judicious-management",[95],{"type":29,"value":96},"The crucial importance of time: time efficiency and judicious management",{"type":23,"tag":32,"props":98,"children":99},{},[100],{"type":29,"value":101},"Time plays a crucial role in this debate. Time efficiency, underlined by the perspective of speed, becomes an essential skill. Judicious time management is the key to maintaining momentum without compromising quality. Consciously choosing where to invest one's time becomes a strategic act.",{"type":23,"tag":47,"props":103,"children":105},{"id":104},"total-control-vs-flexibility-navigating-between-the-two-extremes",[106],{"type":29,"value":107},"Total control vs. flexibility: navigating between the two extremes",{"type":23,"tag":32,"props":109,"children":110},{},[111],{"type":29,"value":112},"Total control of the creative process offers a sense of autonomy and empowerment. However, it is vital not to confuse control with rigidity. Being open to market developments and new trends is just as essential as personal control. It's a delicate balance between autonomy and adaptability.",{"type":23,"tag":47,"props":114,"children":116},{"id":115},"the-delicate-balance-a-continuous-journey-of-discovery-and-adaptation",[117],{"type":29,"value":118},"The delicate balance: a continuous journey of discovery and adaptation",{"type":23,"tag":32,"props":120,"children":121},{},[122],{"type":29,"value":123},"Ultimately, portfolio creation is an ongoing journey. It's navigating this paradox with intention. It's finding a balance between the quest for excellence and the need to move quickly, knowing that each iteration is a progression towards an improved version of yourself. To create a portfolio is to embrace the paradox, to consciously choose between perfection and speed, and to accept that the path to excellence is a journey rather than a destination.",{"title":125,"searchDepth":126,"depth":126,"links":127},"",2,[128],{"id":26,"depth":126,"text":30,"children":129},[130,132,133,134,135,136,137],{"id":49,"depth":131,"text":52},3,{"id":60,"depth":131,"text":63},{"id":71,"depth":131,"text":74},{"id":82,"depth":131,"text":85},{"id":93,"depth":131,"text":96},{"id":104,"depth":131,"text":107},{"id":115,"depth":131,"text":118},"markdown","content:en:articles:launch-your-portfolio.md","content","en/articles/launch-your-portfolio.md","md",1716357232689]